# Packages
brew "awscli"
brew "btop"
brew "coreutils"
brew "curl"
brew "docker"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "jemalloc"
brew "jq"
brew "libpq"
brew "libyaml"
brew "mise"
brew "neovim"
brew "ollama"
brew "overmind"
brew "pnpm"
brew "yarn"
brew "postgresql@17"
brew "redis"
brew "uv"
brew "vercel-cli"
brew "vips"
brew "wget"
brew "zsh"

# Cask applications
cask "1password"
cask "arc"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "thebrowsercompany-dia"
cask "discord"
cask "figma"
cask "ghostty"
cask "iina"
cask "iterm2"
cask "localsend"
cask "loom"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "openvpn-connect"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "rectangle"
cask "slack"
cask "superwhisper"
cask "zed"
cask "zoom"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-commit-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-geist"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-geist-mono"
cask "font-google-sans-code"
cask "font-work-sans"
